package com.array.practice;

/*
 * 다차원 배열
 */
public class D_Dimension {
	/*
	 * 1) 이차원 배열 선언
	 * 	자료형[][] 배열명;
	 *  자료형 배열명[][];
	 *  자료형[] 배열명[];
	 *  
	 * 2) 이차원 배열의 할당
	 *  배열명 = new 자료형[행크기][열크기];
	 *  
	 * 3) 이차원 배열의 선언과 동시에 할당
	 *  자료형[][] 배열명 = new 자료형[행크기][열크기];
	 *  
	 * 4) 이차원 배열의 초기화 
	 * 	- 인덱스로 접근해서 초기화
	 * 	  배열명[0][0] = 값1;
	 *  - 선언과 동시에 초기화
	 *    자료형[][] 배열명 = 
	 *    			{
	 *    				{1,2,3}
	 *    				, {1,2}
	 *    				, {1,2,3,4,5}
	 *    			}
	 *  - 반복문을 이용한 초기화
	 *  
	 */
	public void method1() {
		
	}
}
